"=======================================================Переменные====================================================="
# переменные - именнованные ссылки на ячейки памяти, где хранятся какие-то данные, для дальнейшего использования, при обращении к названию переменной
num1 = 7
num2 = 10
print(num1 + num2)
"=====================================================Ввод и вывод данных====================================================="

# input --- функция, которая позволяет принимать данные с терминала
# print --- функция, которая позволяет выводить данные в терминал

number = input("Введите число:  ")
print ("Введенное число -", number)

"===============================================Правила наименования переменных==============================================="
a = 5 # можно, но не совсем понятно
# 1num = 10 # нельзя начинать с чисел
hello_world = 'hello world' # можно использовать только _
print = 'print' # не стоит, нельзя назвать переменные уже встроенными названиями
# if = 4  # не получится использовать в качестве переменных ключевые слова
#  Snake Case - python стиль написания переменных 
hello_world_aaa_bbb = ''   - tipo etogo tipo snake
# Camel Case - стиль написания переменных во всех других языках программирования
helloWorldAaaBbb = ''      - tipo etogo tipo verblud haha

"=================================================Tипы данных в Python================================================="
#  неизменяемые эти данные. вниз смотри да!!!
int_ = 17   # целые числа
float_ = 34.5 #  не целые
str_ = 'hello'  # строчки, но можно и числа и все символы, но не ковычки вот так вот
bool_1 = True  # просто так нафиг не нужен
bool_2 = False # тоже самое
none_ = None #  чтобы знать что ничего
tuple_ = (хахахахахах1,2,3,4,5,6) # нельзя изменить, измена это плохо

#  а вот и изменяемые данные
list_ = [хвхвхвхвхвхахахахха 1,2,3,4,5,5] # прсто список пишем внутри квадратов и числа можно тоже
set+ = {1,2,1,4} # {1,2,4} он убирает все что повторяется ежже, один среди отсальных туда сюда
dict_ = {'a':1, 'b':2, 'c':3} #надо разделять буквы и числа :


